#include <iostream>
#include <cstdio>
#include <cstring>
using namespace std;


int main()
{
    setlocale (LC_ALL,"Russian");
    char a[80],k=0,K=0,n,i,Z;
    gets(a);// Ввод строки с пробелами
    n=strlen(a);//Вычисляет текущую длину строки а

    for (i=0; i<n; i++)
    {
        Z=int(a[i]);
        if (Z==-96 || Z==-128 || Z==-82 || Z==-114 || Z==-88 || Z==-120 || Z==-91 || Z==-123 || Z==-15 || Z==-16 || Z==-19 || Z==-99 || Z==-21 || Z==-101 || Z==-18 || Z==-98 ||Z==-29 ||Z==-109||Z==-17||Z==-97 )
            k++;// счетчик гласных
        else K++;//счетчик согласных, но с пробелами и числами
        if (Z==32 || Z==48 || Z==49 || Z==50 || Z==51 || Z==52 || Z==53 || Z==54 || Z==55 || Z==56 || Z==57) K--;// отнимаем к если это пробел или цифра
    }

    if (k>K) cout << "гласных больше ";
    else if (k==K) cout << "одинаковое количество ";
    else cout << "согласных больше ";
    return 0;
}





